{
    "event_name": "Newline 0x08",
    "event_venue": "hackerspace.gent",
    "event_url": "https://hackerspace.gent/newline",
    "event_city": "Ghent",
    "event_timezone": "Europe/Brussels",
    "event_start": 1523570400,
    "event_end": 1523829599,
    "event_schedule": [
      {
        "id": 1,
        "name": "Retro games, arcade, movie and music night",
        "description": "We'll set up some old consoles, arcades and have fun! There will be a movie room with the weirdest corners of Youtube. 3D63 will give a chip music game boy performance after 8pm and welcomes everyone to jam together. So bring your instrument, game boy, MIDI board etc with you!",
        "start": 1523635200,
        "duration": 32400,
        "type": "general",
        "rooms": ["1.21"],
        "scheduled": "final",
        "speakers": []
      },
      {
        "id": 2,
        "name": "Welcome!",
        "description": "An introduction to the Hackerspace and Newline!",
        "start": 1523704500,
        "duration": 900,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": []
      },
      {
        "id": 3,
        "name": "Lightning Talks",
        "description": "Anyone has the chance to present a 5 or 10 minute talk. \nJust show up if you have something interesting/entertaining.",
        "start": 1523740500,
        "duration": 3600,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": []
      },
      {
        "id": 5,
        "name": "Mitch Altman: Hackerspace Design Patterns",
        "description": "The famous Mitch Altman, inventor of TV-B-Gone, member of Noisebridge in San Francisco, well known person and expert in the hacker community will talk about Hackerspace Design Patterns. What is a hackerspace? What makes it different from a makerspace or a fablab? He will share his experience of hackerspace communities with us. This talk can lead into a discussion, where we can all talk about what works well and not so well for our hackerspaces so we can all learn from each other, and so people from yet-to-be hackerspaces can get off to a better start.",
        "start": 1523807100,
        "duration": 3600,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Mitch Altman"]
      },
      {
        "id": 6,
        "name": "The Zodiac Killer's z340: like a fake cipher",
        "description": "To this day, the Zodiac Killer's second major cipher, z340, remains unsolved. In this talk, I argue that z340 is most likely a fake cipher. This hypothesis has been put forward before, but without hard evidence. I provide such evidence, which is mainly based on the analysis of mean squared distances for ngrams. This analysis is applied across various ciphers: z340, z408, which is the other major cipher by the Zodiac Killer, twenty generated ciphers based on real texts, and twenty fake ciphers based on random letter sequences. The results show that z340 behaves unlike other true ciphers. Instead, it associates with the fake ciphers.",
        "start": 1523804400,
        "duration": 1800,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Tom"]
      },
      {
        "id": 7,
        "name": "Let's go camping!",
        "description": "We want to invite you all to our two-annual Belgian hacker camp, Fri3d Camp 2018, from 18 to 20 august 2018 at the huge forest domain De Kluis in Sint-Joris-Weert. I (and maybe some other orga) would like to present our camp, invite you all and discuss open questions and suggestions for our camp. If time permits, we may also discuss the development of our camp badge.",
        "start": 1523706300,
        "duration": 1800,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Anthony"]
      },
      {
        "id": 8,
        "name": "Software Defined Radio with HackRF One for beginners",
        "description": "A short introduction into software defined radio using the HackRF One from Great Scott Gadgets with Gnu Radio. Will talk a bit about the basic concepts and then hack the garage door!",
        "start": 1523800800,
        "duration": 2700,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Cedric"]
      },
      {
        "id": 9,
        "name": "DevOps: Managing the technical quality side of big projects",
        "description": "We are creating more complex projects than ever. Managing the technical quality of projects where multiple people work on can be a daunting task. Luckily a few years ago a new concept emerged: Devops. Devops is about combining multiple teams (mostly Developers and Operators) to enable the rapid development and evolution of products and services; and reduce the risk, improve the quality and reduce costs of building those projects. The Devops community also utilizes a lot of tools. Ever heard about Jenkins? Always wanted to know what this GIT is? This session will bring clarity in all the fancy buzzwords.",
        "start": 1523718000,
        "duration": 3600,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Bert"]
      },
      {
        "id": 11,
        "name": "Biohacking intro",
        "description": "Intro to biohacking: what's growing in the world/europe/belgium/ghent? What can YOU do/feed/grow/kill/discover tomorrow?",
        "start": 1523790000,
        "duration": 900,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Winnie"]
      },
      {
        "id": 12,
        "name": "Hardware-Based Trusted Computing from an Attack/Defense Perspective",
        "description": "Protected module architectures (PMAs) are a new brand of security architectures whose main objective is to support the secure isolated execution of software modules with a minimal Trusted Computing Base (TCB). Several prototypes for embedded systems, and also the Software Guard eXtensions (SGX) included in recent Intel x86 processors, ensure isolation with a hardware-only TCB. This talk, based on my ongoing PhD research, highlights two complementary lines of PMA research. On the one hand, I will introduce the free/open-source Sancus hardware-level PMA and embedded (automotive) security applications we are actively developing. On the other hand, I will overview our recent research efforts on side-channel attacks against off-the-shelf Intel SGX platforms.",
        "start": 1523713500,
        "duration": 3600,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Jo"]
      },
      {
        "id": 13,
        "name": "Wireless Belgium",
        "description": "An introduction about Community based WAN (ISP) and LoRaWAN technology.",
        "start": 1523733300,
        "duration": 5400,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": []
      },
      {
        "id": 14,
        "name": "DIY bio techniques",
        "description": "Workshop: let us know what you want to learn about: bioplastics, slime mold, genetic barcoding or requests! Let us know on the event Facebook page https://www.facebook.com/events/143174433013216 or send a message to info@hackerspace.gent",
        "start": 1523791800,
        "duration": 1200,
        "type": "workshop",
        "rooms": ["workshop room 2"],
        "scheduled": "final",
        "speakers": ["Winnie"]
      },
      {
        "id": 15,
        "name": "Kombucha is easy!",
        "description": "Kombucha culture is used to make a healthy probiotic beverages which are good for the digestion. Based on research it also supports your immunity system, lowers risks of variety of cancers and allergy reactions. You will taste different beverages, learn how take properly care of a kombucha culture (mother/SCOBY), how to brew the beverage and take home some culture and the manual so you can continue to do this at home or at your local hackerspace. Biotechnologist and fermentologist Algoldor will teach you step for step and also chat about various alternative usages. This workshop is donation based (PWYW) since Algoldor will be coming all the way from France to give this workshop and will provide the culture and drinks.",
        "start": 1523793600,
        "duration": 3600,
        "type": "workshop",
        "rooms": ["workshop room 2"],
        "scheduled": "final",
        "speakers": ["Algoldor"]
      },
      {
        "id": 16,
        "name": "Introduction to vim",
        "description": "for all of you that edit text files(i'm not talking about Microsoft Word) for a living. There’s a reason people love this editor. find out why during this hands-on workshop. Bring a laptop. You won't need a mouse, ever.",
        "start": 1523709000,
        "duration": 3600,
        "type": "workshop",
        "rooms": ["workshop room 1"],
        "scheduled": "final",
        "speakers": ["Sasja"]
      },
      {
        "id": 17,
        "name": "Lockpicking",
        "description": "Locked yourself out? Lost your key? This workshop will start after the talks about the anatomy of a cylinder lock. We'll go over the basics and then practice the lock picking together! We have locks and lockpicks everybody can use!",
        "start": 1523803500,
        "duration": 3600,
        "type": "workshop",
        "rooms": ["back room"],
        "scheduled": "final",
        "speakers": ["Folkaholic"]
      },
      {
        "id": 18,
        "name": "Learn to Solder!",
        "description": "You can easily learn all of the skills you need in a short time. Make a project, and take it home with you! We'll have kits to make cool, practical, intriguing, hackable things that you can bring home after you make it. Of course, you can also bring your own projects to hack.",
        "start": 1523727000,
        "duration": 7200,
        "type": "workshop",
        "rooms": ["workshop room 1"],
        "scheduled": "final",
        "speakers": ["Mitch Altman"]
      },
      {
        "id": 19,
        "name": "Introduction to web audio",
        "description": "In this talk I will introduce the relatively recent capabilities of browsers for audio processing. More to the point I will introduce parts of the Web Audio API, Web MIDI API and the HTML5 canvas element.\nAs an example application a baby monitor web application will be dissected. To get most out of this talk some elementary knowledge on HTML, CSS and javascript helps. Bring your laptop to run or modify the demos yourself!\nThe aim of this talk is to introduce web audio capabilities and by demonstrating some applications perhaps provide inspiration for your own projects.",
        "start": 1523709000,
        "duration": 3600,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Joren"]
      },
      {
        "id": 20,
        "name": "Ask Merlijn anything about Ubuntu and Open Source",
        "description": "Merlijn knows a bunch about Ubuntu and Open Source. Ask him anything you're curious about..\nExample questions\n\n- What is Open Source?\n- What is Ubuntu?\n- How do the Ubuntu developers get paid?\n- What is Copyleft?\n- What are Snaps, Flatpaks and AppImages?\n- Why is open source so successful?\n- Why isn't open source more successful?\n- Will this be the year of the Linux desktop?",
        "start": 1523729700,
        "duration": 2700,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Merlijn"]
      },
      {
        "id": 21,
        "name": "Getting started with Snapcraft: Package, distribute, and update any app for Linux and IoT.",
        "description": "In this talk you'll learn the basics of Snapcraft, and how Snapcraft can help you to make your application cross-distro on Linux.",
        "start": 1523722500,
        "duration": 1800,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Philip"]
      },
      {
        "id": 22,
        "name": "Building an IoT device (for commercial use)",
        "description": "In this talk you'll get an insight on how a commercial IoT device is set up, both on the hardware and software side.",
        "start": 1523727000,
        "duration": 1800,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Philip"]
      },
      {
        "id": 23,
        "name": "Amateur radio",
        "description": "If you have ever played around with the RTL SDR-dongle to visibly look at radio-signals, listened to shortwave broadcasting station or have a HackRF to play around with radio-protocols, you have probably come across the term 'amateur radio' AKA 'ham radio'.\nThe goal of this talk is to explain what exactly is amateur radio hobby, the amateur-radio culture and how having an amateur radio license can help you with your other hobbies, explore radio in all its facets and simply learn more about technology and science in general.",
        "start": 1523796300,
        "duration": 3600,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Kristoff"]
      },
      {
        "id": 24,
        "name": "Anatomy of the cylinder lock",
        "description": "What parts can you expect to find in a cylinder/pin tumbler lock? And what do these parts do? Introduction to locks.",
        "start": 1523800800,
        "duration": 2700,
        "type": "talk",
        "rooms": ["back room"],
        "scheduled": "final",
        "speakers": ["Birger"]
      },
      {
        "id": 25,
        "name": "Automotive Transponder Keys - introduction",
        "description": "Every* car since 1995 has a transponder key. Learn more about the technology behind it.",
        "start": 1523791800,
        "duration": 3600,
        "type": "talk",
        "rooms": ["talk room"],
        "scheduled": "final",
        "speakers": ["Birger"]
      },
      {
        "id": 26,
        "name": "Chipmusic for everyone!",
        "description": "How can people make music with old retro stuff? A quick review of chiptune music and how you can get that 8-bit retrosounds from a 30 years old gameboy. Bonus stage: and you might be able to catch a live concert from chiptune artist 3D63 if you come!",
        "start": 1523724300,
        "duration": 1800,
        "type": "general",
        "rooms": ["back room"],
        "scheduled": "final",
        "speakers": ["3D63"]
      },
      {
        "id": 27,
        "name": "Kefir workshop",
        "description": "Algoldor from the food hacking base will tell us everything about kefir, the bacteria culture that creates fermented probiotic milk products which are good for the digestion. Based on research it also supports your immunity system, lowers risks of variety of cancers and allergy reactions. You will taste different products (drinks, cheese), take a closer look to the bacteria culture, learn how take properly care of it and take home some culture and the manual so you can continue to do this at home or at your local hackerspace. Biotechnologist and fermentologist Algoldor will teach you step for step and also chat about various alternative usages. Since fermenting processes keep continuing, we will cook something on Saturday, taste it and return on sunday to study the differences (come after the Kombucha workshop).\n\nThis workshop is donation based (PWYW) since Algoldor will be coming all the way from France to give this workshop and will provide the culture, ingredients and drinks.",
        "start": 1523713500,
        "duration": 5400,
        "type": "workshop",
        "rooms": ["workshop room 2"],
        "scheduled": "final",
        "speakers": ["Algoldor"]
      },
      {
        "id": 28,
        "name": "Visual Art with Processing",
        "description": "Let's play with Processing.org, a great tool for doing original, interactive visual art.\nThere will be fun for everyone, whether you have experience with programming or not.\nJust bring a computer, Processing works on Linux, macOS, Windows and Android.\nWe will show you how to get started, then the stage will be yours until the end of the workshop where we will present our creations to each other.",
        "start": 1523713500,
        "duration": 7200,
        "type": "workshop",
        "rooms": ["workshop room 1"],
        "scheduled": "final",
        "speakers": ["OKso"]
      },
      {
        "id": 29,
        "name": "Workshop sewing",
        "description": "Always wanted to sew, but never got the chance? Then this beginners workshop is just what you're looking for. While making a stuffed animal, you'll learn the basics of a sewing machine, pattern assembly and finishing. Max 4 participants without sewing machine or max 6 participants if 2 can bring their own sewing machine. To join this workshop, fill in the poll on the Facebook Event page or send an e-mail to: dorienelleboog@hotmail.com. Our sewing professional is providing all the material and asks €15 to pay back the provided materials.",
        "start": 1523797200,
        "duration": 10800,
        "type": "workshop",
        "rooms": ["workshop room 3"],
        "scheduled": "final",
        "speakers": ["Dorien"]
      },
      {
        "id": 30,
        "name": "Game boy music performance",
        "description": "8 bit musician since 2016, Ganondorofu plays psychedelic dance compositions with lsdj on game boy and an electric bass.",
        "start": 1523739600,
        "duration": 1800,
        "type": "general",
        "rooms": ["back room"],
        "scheduled": "final",
        "speakers": ["Ganondorofu"]
      },
      {
      	"id": 31,
      	"name": "A pretty good introduction to PGP and keysigning parties",
      	"description": "Protect your data and identity! An introduction to PGP public key cryptography, keysigning party included. Keysigning parties are events where people digitally sign each other's digital identities, helping to create trust that the digital identity really belongs to the real person who claims to own it.\nRequirements: No preparation is necessary except for you to bring two government issued identity documents (ID, driver's license, passport) and a laptop. We will guide you through every step from key generation to verifying. Organizer contact info: https://keybase.io/gillesjacobs",
        "start": 1523719800,
        "duration": 7200,
        "type": "workshop",
        "rooms": ["workshop room 2"],
        "scheduled": "final",
        "speakers": ["enzian"]
      }
    ]
  }
