{
    "event_name": "Newline 0x09",
    "event_venue": "hackerspace.gent",
    "event_url": "https://hackerspace.gent/newline",
    "event_city": "Ghent",
    "event_timezone": "Europe/Brussels",
    "event_start": 1556290800,
    "event_end": 1556488799,
    "event_schedule": [
      {
        "id": 1,
        "name": "Retro games, arcade, movie and music night",
        "description": "We'll set up some old consoles, arcades and have fun!",
        "start": 1556290800,
        "duration": 25200,
        "type": "general",
        "rooms": ["the hackerspace"],
        "scheduled": "final",
        "speakers": []
      },
      {
        "id": 2,
        "name": "Welcome!",
        "description": "An introduction to the Hackerspace and Newline!",
        "start": 1556352000,
        "duration": 900,
        "type": "talk",
        "rooms": ["talks room"],
        "scheduled": "final",
        "speakers": ["Merlijn"]
      },
      {
        "id": 3,
        "name": "Sewing workshop for beginners",
        "description": "In this workshop we will be making Sasha. Sasha the cat has a soft snout, belly and stripes. She has velcro on both sides. If you loosen the velcro, the cat becomes a pillow. The tail is inspired by Kiwi's tail. You can make the cat in the color 'Black' or 'Summer'. No sewing experience required!",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Dorien"]
      },
      {
        "id": 4,
        "name": "Making a PC 4K intro",
        "description": "This workshop introduces the basics on rendering graphics using a fragment-shader approach (GLSL), the basics of audio synthesis, and executable compression. The shader part will be coded live, and participants are encouraged to code along as well, using Bonzomatic. (Please install Bonzomatic before the workshop)",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["PoroCYon"]
      },
      {
        "id": 5,
        "name": "Technologische Soevereiniteit 2 - Het Boek",
        "description": "This is a dutch 'promo'-talk to introduce the writings of the 'sobtec2'-book into the dutch language domain. Besides a short intro into the theme and the various resulting essays, we'll discuss experiences gathered during the translation process, the printing phase and of publishing an actual book.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["vhill"]
      },
      {
        "id": 6,
        "name": "Introduction to programming for absolute beginners with Python",
        "description": "We will cover the very basics to get started with programming and write a few programs together. If you have a laptop, please bring it with you. If you don't, then please let us know and we'll organise one for you.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["superpumpie"]
      },
      {
        "id": 8,
        "name": "OpenStreetMap: what is it and how do I contribute?",
        "description": "This talk gives a basic introduction on OpenStreetMap - a bit of history, comparison with other map providers, ... We end with a look into the data model and how you can contribute as well to add your favourite venues.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["pietervdvn"]
      },
      {
        "id": 9,
        "name": "OpenStreetMap on your phone: OsmAnd",
        "description": "Get out your (Android) phone, I'll show you around the most useful functions of the OsmAnd-app.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["pietervdvn"]
      },
      {
        "id": 10,
        "name": "Home Assistant",
        "description": "Presenting our implementations of home assistant and related home automation stuff",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Mike","thouters"]
      },
      {
        "id": 11,
        "name": "Debian packaging for absolute beginners",
        "description": "An introduction to making Debian packages, starting from just a tarball. We'll go over Debian policy, so that your packages fit into the rest of the system nicely, using debconf to configure your package at install time, and how to maintain your changes to an upstream source package",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["TQ"]
      },
      {
        "id": 12,
        "name": "Wireless Belgium",
        "description": "",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["on8wr"]
      },
      {
        "id": 13,
        "name": "Art of the Algorithms",
        "description": "Ever witnessed a program doing something you couldn't believe was possible? Amazed by ShaderToy experiments or people misusing hardware bugs in computers from the 80s? Do you want to participate, but don't know where to start? This presentation gives a broad overview of the demoscene, both technically and socially, and gives a few pointers on where to start making demos yourself.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["PoroCYon"]
      },
      {
        "id": 14,
        "name": "Building musical automats",
        "description": "The Logos Foundation is over 50 years active in combining the fields of music, art and technology. Its founder Godfried-Willem Raes will give a lecture on building musical automats. He'll bring the robot 2pi, a miniature organ, and talk about the development of this automated instrument.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Godfried-Willem Raes"]
      },
      {
        "id": 16,
        "name": "Between The Senses: Sound, Colour, and Synaesthesia",
        "description": "In this lecture Umut Eldem talks about synaesthesia, a rare brain condition that lets people see colours and shapes when they hear sounds and music. Looking at established composers and artists who have used their synaesthesia in their works, we will see how the phenomenon relates to the ways we combine sounds and colours, which electronic tools we can use to recreate it, and how we can make art from it.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Umut Eldem"]
      },
      {
        "id": 17,
        "name": "3D63 Live concert",
        "description": "Music producer for a decade, Andrea La Rosa (a.k.a 3D63) is a big fan of analog aesthetics and sci-fi universes. Composing with 30 years old Nintendo Gameboy, she can make those still dance hard like there's no (not dystopian) future and takes you to a journey into Cyberia, her own artistic universe.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "general",
        "scheduled": "unknown",
        "speakers": ["3D63"]
      },
      {
        "id": 18,
        "name": "Making music with automats",
        "description": "The Logos Foundation is over 50 years active in combining the fields of music, art and technology. We'll bring the robot <2pi>, a miniature organ. People interested in working with the little organ, can join this workshop. Bring a laptop with your favorite DAW or other MIDI editor and optionally some sensors or other toys!",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Lara Van Wynsberghe"]
      },
      {
        "id": 19,
        "name": "Lishi Automotive Lock Picks",
        "description": "Lishi tools are used by locksmiths to gain entry to a car. There are various different types and models. This lecture tells you how they work and what is available.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Birger"]
      },
      {
        "id": 20,
        "name": "\"PONG\" arcade game - solder your own!",
        "description": "Soldering workshop - make your own \"PONG\" clone! We'll assemble a kit based on the ATmega328 microcontroller and a few 3D-printed parts. The ATmega simulates the gameplay, and also generates a PAL video signal that you can view on your TV. At the end of the workshop, you should be able to play your own game on a TV. The kit includes both through-hole components, and SMD components.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Joris VL"]
      },
      {
        "id": 21,
        "name": "Lightning Talks (10m max, we'll be ruthless)",
        "description": "- How chiptune helped me to be more creative (3D63)<br>- Astropolis: space science center in Ostend (Mike)<br>- whoever takes the stage (you?)",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["You?"]
      }
    ]
  }
