{
    "event_name": "Newline 0x09",
    "event_venue": "hackerspace.gent",
    "event_url": "https://hackerspace.gent/newline",
    "event_city": "Ghent",
    "event_timezone": "Europe/Brussels",
    "event_start": 1556290800,
    "event_end": 1556488799,
    "event_schedule": [
      {
        "id": 1,
        "name": "Retro games, arcade, movie and music night",
        "description": "We'll set up some old consoles, arcades and have fun!",
        "start": 1556290800,
        "duration": 25200,
        "type": "general",
        "rooms": ["the hackerspace"],
        "scheduled": "final",
        "speakers": []
      },
      {
        "id": 2,
        "name": "Welcome!",
        "description": "An introduction to the Hackerspace and Newline!",
        "start": 1556362800,
        "duration": 900,
        "type": "talk",
        "rooms": ["talks room"],
        "scheduled": "final",
        "speakers": ["Merlijn"]
      },
      {
        "id": 3,
        "name": "Sewing workshop for beginners",
        "description": "In this workshop we will be making Sasha. Sasha the cat has a soft snout, belly and stripes. She has velcro on both sides. If you loosen the velcro, the cat becomes a pillow. The tail is inspired by Kiwi's tail. You can make the cat in the color 'Black' or 'Summer'. No sewing experience required! <a href=\"https://ririkiwi.be/index.php?route=product/product&product_id=14816\">(register here)</a>",
        "start": 1556452800,
        "duration": 18000,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Dorien"]
      },
      {
        "id": 4,
        "name": "Making a PC 4K intro",
        "description": "This workshop introduces the basics on rendering graphics using a fragment-shader approach (GLSL), the basics of audio synthesis, and executable compression. The shader part will be coded live, and participants are encouraged to code along as well, using Bonzomatic. (Please install Bonzomatic before the workshop)",
        "start": 1556374500,
        "duration": 2700,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["PoroCYon", "Svn"]
      },
      {
        "id": 5,
        "name": "Technologische Soevereiniteit 2 - Het Boek",
        "description": "This is a dutch 'promo'-talk to introduce the writings of the 'sobtec2'-book into the dutch language domain. Besides a short intro into the theme and the various resulting essays, we'll discuss experiences gathered during the translation process, the printing phase and of publishing an actual book.",
        "start": 1556458200,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["vhill"]
      },
      {
        "id": 6,
        "name": "Introduction to programming for absolute beginners with Python",
        "description": "We will cover the very basics to get started with programming and write a few programs together. If you have a laptop, please bring it with you. If you don't, then please let us know and we'll organise one for you. <a href=\"https://www.meetup.com/HackerspaceGent/events/260078681/\">(register here)</a>",
        "start": 1556390700,
        "duration": 10800,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["superpumpie"]
      },
      {
        "id": 8,
        "name": "OpenStreetMap: what is it and how do I contribute?",
        "description": "This talk gives a basic introduction on OpenStreetMap - a bit of history, comparison with other map providers, ... We end with a look into the data model and how you can contribute as well to add your favourite venues.",
        "start": 1556460900,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["pietervdvn"]
      },
      {
        "id": 9,
        "name": "OpenStreetMap on your phone: OsmAnd",
        "description": "OsmAnd is an (Android) app which gets all OpenStreetMap data locally and gives you instructions. But there is a lot more to discover, hidden behind to many buttons. I'll show you around.",
        "start": 1556464500,
        "duration": 1800,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["pietervdvn"]
      },
      {
        "id": 10,
        "name": "Home Assistant",
        "description": "Presenting our implementations of home assistant and related home automation stuff",
        "start": 1556378100,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Mike","thouters"]
      },
      {
        "id": 11,
        "name": "Debian packaging for absolute beginners",
        "description": "An introduction to making Debian packages, starting from just a tarball. We'll go over Debian policy, so that your packages fit into the rest of the system nicely, using debconf to configure your package at install time, and how to maintain your changes to an upstream source package",
        "start": 1556363700,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["TQ"]
      },
      {
        "id": 12,
        "name": "Wireless Belgium",
        "description": "",
        "start": 1556391600,
        "duration": 5400,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["on8wr"]
      },
      {
        "id": 13,
        "name": "Introduction to the demoscene",
        "description": "Ever witnessed a program doing something you couldn't believe was possible? Amazed by ShaderToy experiments or people misusing hardware bugs in computers from the 80s? Do you want to participate, but don't know where to start? This presentation gives a broad overview of the demoscene, both technically and socially, and gives a few pointers on where to start making demos yourself.",
        "start": 1556370000,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["PoroCYon", "Svn"]
      },
      {
        "id": 14,
        "name": "Building musical automats",
        "description": "The Logos Foundation is over 50 years active in combining the fields of music, art and technology. Its founder Godfried-Willem Raes will give a lecture on building musical automats. He'll bring the robot 2pi, a miniature organ, and talk about the development of this automated instrument.",
        "start": 1556381700,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Godfried-Willem Raes"]
      },
      {
        "id": 16,
        "name": "Between The Senses: Sound, Colour, and Synaesthesia",
        "description": "In this lecture Umut Eldem talks about synaesthesia, a rare brain condition that lets people see colours and shapes when they hear sounds and music. Looking at established composers and artists who have used their synaesthesia in their works, we will see how the phenomenon relates to the ways we combine sounds and colours, which electronic tools we can use to recreate it, and how we can make art from it.",
        "start": 1556372700,
        "duration": 1800,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Umut Eldem"]
      },
      {
        "id": 17,
        "name": "3D63 Live concert",
        "description": "Music producer for a decade, Andrea La Rosa (a.k.a 3D63) is a big fan of analog aesthetics and sci-fi universes. Composing with 30 years old Nintendo Gameboy, she can make those still dance hard like there's no (not dystopian) future and takes you to a journey into Cyberia, her own artistic universe.",
        "start": 0,
        "duration": 0,
        "rooms": [],
        "type": "general",
        "scheduled": "unknown",
        "speakers": ["3D63"]
      },
      {
        "id": 18,
        "name": "Making music with automats",
        "description": "The Logos Foundation is over 50 years active in combining the fields of music, art and technology. We'll bring the robot <2pi>, a miniature organ. People interested in working with the little organ, can join this workshop. Bring a laptop with your favorite DAW or other MIDI editor and optionally some sensors or other toys!",
        "start": 1556386200,
        "duration": 3600,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Lara Van Wynsberghe"]
      },
      {
        "id": 19,
        "name": "Lishi Automotive Lock Picks",
        "description": "Lishi tools are used by locksmiths to gain entry to a car. There are various different types and models. This lecture tells you how they work and what is available.",
        "start": 1556388000,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Birger"]
      },
      {
        "id": 20,
        "name": "\"PONG\" arcade game - solder your own!",
        "description": "Soldering workshop - make your own \"PONG\" clone! We'll assemble a kit based on the ATmega328 microcontroller and a few 3D-printed parts. The ATmega simulates the gameplay, and also generates a PAL video signal that you can view on your TV. At the end of the workshop, you should be able to play your own game on a TV. The kit includes both through-hole components, and SMD components. <a href=\"https://www.meetup.com/HackerspaceGent/events/260109643/\">(register here)</a>",
        "start": 1556377200,
        "duration": 7200,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Joris VL"]
      },
      {
        "id": 21,
        "name": "DNA extraction workshop & Genetics 101",
        "description": "~Don't let your genes be dreams!~ Using the power of good hard booze, pull the DNA from your very own cheek cells! All materials provided. Except your DNA, of course. That would be pretty weird. <a href=\"https://www.meetup.com/HackerspaceGent/events/260396222/\">(register here)</a>",
        "start": 1556379000,
        "duration": 2700,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Alex"]
      },
      {
        "id": 22,
        "name": "How to run an unstructured organization",
        "description": "When Hackerspace Ghent was on the brink of collapse because of internal conflict, we started the \"hack the hackerspace\" workshops to figure out how to run a hackerspace. Out of these workshops grew the \"Hack the hackerspace manifesto\", an elaborate document describing how to run an organization using do-ocracy.",
        "start": 1556397900,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Merlijn"]
      },
      {
        "id": 23,
        "name": "Introduction to open source",
        "description": "Open Source Software is all around us. Smartphones, websites and the internet all run on open source software. Even Microsoft, a long time critic of open source has drastically changed its views and now considers open source software a core part of its business.  But what is open source exactly? What does it mean for something to be open source? Why is it all around us and how does it work? This talk gives an introduction to open source and answers these and many other questions.",
        "start": 1556366400,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Merlijn"]
      },
      {
        "id": 24,
        "name": "Noise Explorer",
        "description": "The Noise Protocol Framework, introduced recently, allows for the design and construction of secure channel protocols by describing them through a simple, restricted language from which complex key derivation and local state transitions are automatically inferred. Noise \"Handshake Patterns\" can support mutual authentication, forward secrecy, zero round-trip encryption, identity hiding and other advanced features. Since the framework's release, Noise-based protocols have been adopted by WhatsApp, WireGuard and other high-profile applications.",
        "start": 1556386200,
        "duration": 1800,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Nadim Kobeissi"]
      },
      {
        "id": 25,
        "name": "Ancestry Testing",
        "description": "In this talk I hope to explain how ancestry testing is performed, what it can tell you, and discuss ethical concerns.",
        "start": 1556375400,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Alex"]
      },
      {
        "id": 26,
        "name": "A Pictograph is Worth a Thousand Words",
        "description": "In this lecture, I will present the Picto technology, a set of tools that help improve accessibility to the Internet for people with an intellectual disability (ID). Picto automatically translates Dutch natural language text into pictographs and vice versa, allowing people with limited literacy skills to read and write status updates, emails, and chat messages in online environments.",
        "start": 1556455500,
        "duration": 1800,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Leen Sevens"]
      },
      {
        "id": 27,
        "name": "KiCad: from schematic to PCB",
        "description": "An introduction to the KiCad suite of electronic design tools. We go from drawing a (given) schematic to drawing the pcb and generating the files to send to a manufacturer. Requirements: a laptop with KiCad installed (version 5 strongly preferred but 4 will do), a mouse is recommended but not required.",
        "start": 1556388000,
        "duration": 10800,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Evils"]
      },
      {
        "id": 28,
        "name": "Lightning Talks & Powerpoint Karaoke",
        "description": "10m max, we'll be ruthless in enforcing the time limit this year.",
        "start": 1556400600,
        "duration": 0,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["You?"]
      },
      {
        "id": 29,
        "name": "Receiving images from satellites with the RTL-dongle + build your own antenna",
        "description": "This workshop teaches you all necessary steps to use this device to receive pictures from low-orbit weather-satellites and amateur-radio slow-scan TV transmissions from the ISS. <a href=\"https://www.meetup.com/HackerspaceGent/events/260076629/\">(register here)</a>",
        "start": 1556363700,
        "duration": 10800,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Krist","Kristoff"]
      },
      {
        "id": 30,
        "name": "Test automation with Robot Framework",
        "description": "To give some hands-on experience in, Robot Framework, Selenium, Jenkinsi. ABCD-TA (Any Body Can Do - Test Automation) This workshop is to give you hands-on experience in Test automation. ",
        "start": 1556452800,
        "duration": 10800,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Shenthilkumar Subburam"]
      },
      {
        "id": 31,
        "name": "Donkey Kong king of the Konga",
        "description": "Doing fancy stuff with your API's. Setting up rate limiting, authorization and more... in just 42 easy steps.",
        "start": 1556452800,
        "duration": 1800,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["Koen"]
      },
      {
        "id": 32,
        "name": "Stick welding is easy!",
        "description": "hahaha! no it's not. Unlike soldering learning how to do a simple decent looking weld takes hours if not days of practice. If you have never welded before and you are curious about it, this is for you. We'll go from practice lines to some basic joints and then laugh together at the mess we make trying to weld a small stove. Send a mail to sasja.ws@gmail.com to register since we can only do a few people.",
        "start": 1556460000,
        "duration": 10800,
        "rooms": [],
        "type": "workshop",
        "scheduled": "unknown",
        "speakers": ["Sasja"]
      },
      {
        "id": 33,
        "name": "Fri3d 2020",
        "description": "A lot has changed in the fri3d camp organization. We will try to bring you up to speed. We will be much more open in how we organize it, and would like the input from the community. I'll explain what Fri3d is, and give you a brief overview of the plans for 2020.",
        "start": 1556464500,
        "duration": 2700,
        "rooms": [],
        "type": "talk",
        "scheduled": "unknown",
        "speakers": ["warddr"]
      }
    ]
  }
